# StairsDbgShowTriserGeom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowTriserGeom Property
ParameterTypeId Class See Also
---
"Show Triser Geometry"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowTriserGeom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowTriserGeom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowTriserGeom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace